# Intro python data science
## Práctica 07: importar datos de excel a python

Vamos a ver cómo importar excel cuando:
* Punto 1: tenemos datos con nombre de columna y en la primera hoja
* Punto 2: los datos no están en la primera hoja
* Punto 3: no hay nombres de columnas

# Punto 0:

In [1]:
# importar pandas
import pandas as pd

In [2]:
# extraer ruta del archivo
path = 'datos_rrss.xlsx'

# Punto 1:

In [ ]:
# caso 1: datos completos en la primera hoja

In [3]:
pd.read_excel(path)

      Nombre  Cantidad  ES_FBK   Año
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
2  Instagram      1000    True  2010
3    YouTube      2000   False  2005
4   LinkedIn       663   False  2003
5   WhatsApp      1600    True  2009

# Punto 2:

In [ ]:
# caso 2: los datos no están en la primera hoja

In [4]:
pd.read_excel(path, sheet_name='Hoja2')

      Nombre  Cantidad  ES_FBK   Año
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
2  Instagram      1000    True  2010

# Punto 3:

In [ ]:
# caso 3: no hay nombres de columnas

In [8]:
pd.read_excel(path, sheet_name='Hoja3')

    Facebook  2449   True  2006  Unnamed: 4  Unnamed: 5  Unnamed: 6
0    Twitter   339  False  2006         NaN         NaN         NaN
1  Instagram  1000   True  2010         NaN         NaN         NaN
2    YouTube  2000  False  2005         NaN         NaN         NaN
3   LinkedIn   663  False  2003         NaN         NaN         NaN
4   WhatsApp  1600   True  2009         NaN         NaN         NaN

In [10]:
pd.read_excel(path, sheet_name='Hoja3', header=None, names=['Nombre', 'Cantidad', 'ES_FBK', 'Año', '', '', ''])

      Nombre  Cantidad  ES_FBK   Año      .1  .2
0   Facebook      2449    True  2006 NaN NaN NaN
1    Twitter       339   False  2006 NaN NaN NaN
2  Instagram      1000    True  2010 NaN NaN NaN
3    YouTube      2000   False  2005 NaN NaN NaN
4   LinkedIn       663   False  2003 NaN NaN NaN
5   WhatsApp      1600    True  2009 NaN NaN NaN

# Gracias!
## Espero que te lleves algo útil de este notebook 😀

Para más videos de programación para ciencia de datos

https://www.youtube.com/c/RafaGonzalezGouveia/

Si quieres realizar alguno de los cursos online de pago, ve a:

https://cursos.gonzalezgouveia.com